In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [4]:
df

          W         X         Y         Z
A  0.256250  0.132589 -0.297001  1.543493
B  2.038762 -0.329719  1.042570 -0.044173
C -0.323837 -0.680974 -0.506321 -0.659589
D  1.626679  1.295829  0.377839 -0.016823
E -2.686686  0.088520  0.844070 -0.430931

In [7]:
df>0

       W      X      Y      Z
A   True   True  False   True
B   True  False   True  False
C  False  False  False  False
D   True   True   True  False
E  False   True   True  False

In [8]:
booldf=df>0

In [9]:
df[booldf]

          W         X         Y         Z
A  0.256250  0.132589       NaN  1.543493
B  2.038762       NaN  1.042570       NaN
C       NaN       NaN       NaN       NaN
D  1.626679  1.295829  0.377839       NaN
E       NaN  0.088520  0.844070       NaN

In [10]:
df['W']>0

A     True
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [11]:
df['W']

A    0.256250
B    2.038762
C   -0.323837
D    1.626679
E   -2.686686
Name: W, dtype: float64

In [12]:
df[df['W']>0]

          W         X         Y         Z
A  0.256250  0.132589 -0.297001  1.543493
B  2.038762 -0.329719  1.042570 -0.044173
D  1.626679  1.295829  0.377839 -0.016823

In [15]:
resultdf=df[df['Z']<0]

In [16]:
resultdf['X']

B   -0.329719
C   -0.680974
D    1.295829
E    0.088520
Name: X, dtype: float64

In [22]:
df[df['W']>0][['Y','X']]

          Y         X
A -0.297001  0.132589
B  1.042570 -0.329719
D  0.377839  1.295829

In [27]:
boolser=df['W']>0
result=df[boolser]
mycols=['Y','X']
result[mycols]

          Y         X
A -0.297001  0.132589
B  1.042570 -0.329719
D  0.377839  1.295829

In [25]:
df

          W         X         Y         Z
A  0.256250  0.132589 -0.297001  1.543493
B  2.038762 -0.329719  1.042570 -0.044173
C -0.323837 -0.680974 -0.506321 -0.659589
D  1.626679  1.295829  0.377839 -0.016823
E -2.686686  0.088520  0.844070 -0.430931

In [28]:
df[(df['W']>0)&(df['Y']>1)]

          W         X        Y         Z
B  2.038762 -0.329719  1.04257 -0.044173

In [29]:
df[(df['W']>0)|(df['Y']>1)]

          W         X         Y         Z
A  0.256250  0.132589 -0.297001  1.543493
B  2.038762 -0.329719  1.042570 -0.044173
D  1.626679  1.295829  0.377839 -0.016823

In [30]:
df

          W         X         Y         Z
A  0.256250  0.132589 -0.297001  1.543493
B  2.038762 -0.329719  1.042570 -0.044173
C -0.323837 -0.680974 -0.506321 -0.659589
D  1.626679  1.295829  0.377839 -0.016823
E -2.686686  0.088520  0.844070 -0.430931

In [31]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.256250  0.132589 -0.297001  1.543493
1     B  2.038762 -0.329719  1.042570 -0.044173
2     C -0.323837 -0.680974 -0.506321 -0.659589
3     D  1.626679  1.295829  0.377839 -0.016823
4     E -2.686686  0.088520  0.844070 -0.430931

In [33]:
newind='CA NY WY OR CO'.split()

In [34]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [35]:
df['States']=newind

In [36]:
df

          W         X         Y         Z States
A  0.256250  0.132589 -0.297001  1.543493     CA
B  2.038762 -0.329719  1.042570 -0.044173     NY
C -0.323837 -0.680974 -0.506321 -0.659589     WY
D  1.626679  1.295829  0.377839 -0.016823     OR
E -2.686686  0.088520  0.844070 -0.430931     CO

In [37]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.256250  0.132589 -0.297001  1.543493
NY      2.038762 -0.329719  1.042570 -0.044173
WY     -0.323837 -0.680974 -0.506321 -0.659589
OR      1.626679  1.295829  0.377839 -0.016823
CO     -2.686686  0.088520  0.844070 -0.430931